{
    "characters": [
        {
            "name": "Arkhe",
            "hp": 1000,
            "speed": 35,
            "rarity": "UR",
            "SigChargeReq": 100,
            "imageName": "Arkhe",
            "moves": [
                {
                    "name": "Elemental Master",
                    "description": "All elemental damage increased by 10%",
                    "cooldown": 0
                },
                {
                    "name": "Airburst",
                    "description": "Arkhe shoots a gust of air dealing 30 air damage. Affected enemies have a 15% chance of being stunned next turn.",
                    "cooldown": 1
                },
                {
                    "name": "Elemental Support",
                    "description": "Using the mastery of water and warth, provide 20 healing and 15 shield to an ally",
                    "cooldown": 3
                },
                {
                    "name": "Monk's Rage",
                    "description": "Arkhe deals 100 fire damage",
                    "cooldown": 1
                }
            ],
            "lore":"Arkhe is a monk from Valkun’s Reach, an isolated city on a distant world built beneath a stable skyborne rift. He is unaffiliated with any galactic organization but is respected across systems as a wandering elemental warrior. He is known primarily as an elemental monk — someone whose body and spirit have harmonized with the leylines near the Valkun Rift."
        },
        {
            "name": "Avarice",
            "hp": 480,
            "speed": 20,
            "rarity": "R",
            "SigChargeReq": 160,
            "imageName": "Avarice",
            "moves": [
                {
                    "name": "Water Priestess",
                    "description": "Water and Ice damage aimed at Avarice is converted into health instead",
                    "cooldown": 0
                },
                {
                    "name": "God Blow",
                    "description": "Avarice deals 30 water damage",
                    "cooldown": 1
                },
                {
                    "name": "Blessing",
                    "description": "Avarice heals a character for 75 HP",
                    "cooldown": 2
                },
                {
                    "name": "Resurrection",
                    "description": "Avarice can bring back a character that died this turn with 25% HP",
                    "cooldown": 1
                }
            ],
            "lore": "Avarice is a water-attuned cleric hailing from Del'Terah, a lush oceanic planet marked by vast fjords, sunken temples, and semi-submerged cities. She is a devout follower of the water goddess Myriel and serves as a traveling divine channeler. She is both a healer and a wielder of destructive tidal magic. Though not formally tied to any galactic faction, she has participated in several interstellar operations under alliance banners when rift activity threatens sacred waters."
        },
        {
            "name": "Captain Dinso",
            "hp": 800,
            "speed": 30,
            "rarity": "R",
            "SigChargeReq": 90,
            "imageName": "Dinso",
            "moves": [
                {
                    "name": "Vibranium Protection",
                    "description": "If an energy attack below 40 damage targets the Captain, there is a 50% chance for the damage to be reflected back",
                    "cooldown": 0
                },
                {
                    "name": "Shield Bash",
                    "description": "The Captain slams his shield and does 20 physical damage.",
                    "cooldown": 1
                },
                {
                    "name": "Ricochet",
                    "description": "The Captain skillfully throws his shield at an enemy and bounces it off them to hit a second enemy, dealing 15 physical damage each time.",
                    "cooldown": 2
                },
                {
                    "name": "Constellian Command",
                    "description": "Allies receive a signature charge equal to 50% of their requirement. All debuffs on any party members are erased.",
                    "cooldown": 1
                }
            ],
            "lore": "Dinso is a decorated officer of the Constellian Army, best known as the commanding captain of the 73rd Constellian Company (73rd CC). The 73rd CC is a versatile deployment unit stationed for rapid planetary response. Born in Silgar and trained at StarSprawler Academy, Dinso later transferred into the Constellian forces, rising through the ranks not just through tactical success but for his unwavering reputation as a protector and battlefield leader."
        },
        {
            "name": "Faru",
            "hp": 600,
            "speed": 25,
            "rarity": "UC",
            "SigChargeReq": 110,
            "imageName": "Faru",
            "moves": [
                {
                    "name": "Rift Mutation",
                    "description": "All healing and damage bonus buffs given to Faru will be doubled",
                    "cooldown": 0
                },
                {
                    "name": "Silver Sword Slash",
                    "description": "Faru attacks with his greatsword for 25 physical damage.",
                    "cooldown": 1
                },
                {
                    "name": "Flaming Sword Strike",
                    "description": "Faru infuses his sword with fire and attacks for 45 fire damage. He has a 60% chance to inflict Burn, which deals 20 damage on the next turn.",
                    "cooldown": 2
                },
                {
                    "name": "All Out",
                    "description": "Faru deals 60 physical damage. This damage is increased by 30 for every buff he currently has",
                    "cooldown": 1
                }
            ],
            "lore":"Faru is a Rifthunter from Thalnys, a remote and technologically underdeveloped planet far from the galactic core. While Thalnys rarely sees large-scale rift events, it suffers from constant minor riftbreaks, which have over time led to extensive mutation of native wildlife and unstable terrain. Without a centralized military, most villages and small cities rely on freelance rifthunters for protection — genetically altered warriors trained from youth to combat rift-corrupted threats."
        },
        {
            "name": "Huron",
            "hp": 1200,
            "speed": 90,
            "rarity": "L",
            "SigChargeReq": 200,
            "imageName": "Huron",
            "moves": [
                {
                    "name": "Silgar's Undying Protector",
                    "description": "Huron gains a 25% damage bonus for every 70 HP he regains. This effect can occur 3 times",
                    "cooldown": 0
                },
                {
                    "name": "Scorch Ray",
                    "description": "Huron fires a blast dealing 50 energy damage",
                    "cooldown": 1
                },
                {
                    "name": "Solar Cover",
                    "description": "Huron deals 18 energy damage to all enemies, and inflicts blinding,lowering their accuracy by 20% for the next turn",
                    "cooldown": 3
                },
                {
                    "name": "Silgar's Might",
                    "description": "Huron creates a dragon of pure energy, punching through it to deal 160 energy damage",
                    "cooldown": 1
                }
            ],
            "lore": "Huron is one of the most powerful mortals in Arkhalion’s history, a warrior of near-divine might and the living embodiment of Silgar’s martial spirit. He was discovered as an infant in the aftermath of a failed IWO purification ritual. His origin defies replication, and he has an affinity for divine magic and natural arcane resistance.Trained by Gosen, Silgar’s founder and last living divine general, Huron was raised in a world clawing its way back from oblivion. Though not a leader in the traditional sense, he became a symbol of resilience and the most celebrated independent combatant of the Delta, and perhaps soon the entire Constellian Alliance."
        },
        {
            "name": "Jack",
            "hp": 400,
            "speed": 20,
            "rarity": "UC",
            "SigChargeReq": 50,
            "imageName": "Jack",
            "moves": [
                {
                    "name": "Crafty Crafty",
                    "description": "If an attack would have killed jack, it will instead reduce his hp to 1",
                    "cooldown": 30
                },
                {
                    "name": "Blaster Rifle",
                    "description": "Jack shoots his rifle, dealing 20 energy damage.",
                    "cooldown": 1
                },
                {
                    "name": "Targeted Strike",
                    "description": "Jack verbally abuses an enemy inflicting 'Mocked'. The next ally to attack the mocked enemy gains +20% damage",
                    "cooldown": 3
                },
                {
                    "name": "Cindrillian Enhancements",
                    "description": "All allies gain a 30% damage bonus and 10 shield points",
                    "cooldown": 1
                }
            ],
            "lore":"Jack is a rogue artificer and saboteur hailing from Cindralith, known for his deep understanding of arcano-technological systems and a long history of weaponized mischief. Once a promising student at one of Cindralith’s top-tier engineering universities, Jack dropped out, or was expelled, depending on which version of the story he’s telling, and disappeared into the undercity.\nHe has since reemerged as a solo operative, deploying experimental gadgets and improvised tech to disable military-grade systems, disorient enemies, and undermine larger power structures. While not formally aligned with any state or institution, Jack often appears in Constellian Army databases , as a person of interest linked to unsanctioned weapons theft, sabotage, or data extraction."
        },
        {
            "name": "KAS",
            "hp": 800,
            "speed": 35,
            "rarity": "R",
            "SigChargeReq": 0,
            "imageName": "KAS",
            "moves": [
                {
                    "name": "Kinematic Assault Specialist",
                    "description": "If KAS wasn’t attacked during the previous turn, he gains a 10-point shield at the start of his turn.",
                    "cooldown": 0
                },
                {
                    "name": "Cinder Stream",
                    "description": "KAS slashes the enemy in a flurry of strikes, dealing 40 physical damage.",
                    "cooldown": 1
                },
                {
                    "name": "Dual Wield Precision",
                    "description": "KAS dashes to strike two enemies with 25 physical damage each. If only one enemy remains, both hits hit them.",
                    "cooldown": 2
                },
                {
                    "name": "Sword Skill: Eclipse",
                    "description": "KAS unleashes a finishing combo dealing 100 energy damage and grants himself 10 shield.",
                    "cooldown": 1
                }
            ],
            "lore": "KAS (Kinematic Assault System) is a hyper-agile mechanized combat unit developed by a private military tech group in Cindralith under the banner of Halion Dynamics. Designed to serve as a single-unit strike operative, KAS combines state-of-the-art technomantic circuitry with physical design principles derived from Rift-class creature countermeasures. The result is a machine optimized for high-speed, close-quarters combat — one that moves with frightening precision, reacts faster than the human eye, and follows its combat directives with unrelenting efficiency."
        },
        {
            "name": "Krakoa",
            "hp": 1000,
            "speed": 26,
            "rarity": "UR",
            "SigChargeReq": 130,
            "imageName": "Krakoa",
            "moves": [
                {
                    "name": "CA's Special Force",
                    "description": "Krakoa's physical and fire resistance increase by 10% for every 20% reduction in his health",
                    "cooldown": 0
                },
                {
                    "name": "Riftbreaker Axe",
                    "description": "Krakoa attacks with his axe and deals 35 Ice damage.",
                    "cooldown": 1
                },
                {
                    "name": "WarFrost",
                    "description": "Krakoa's axe unleashes a wall of ice, dealing 30 Ice damage. He inflicts Chill on an enemy for 2 turns, dealing 20 ice damage",
                    "cooldown": 2
                },
                {
                    "name": "Warriors Rage",
                    "description": "Krakoa heals himself for 100 and becomes enraged for the next two turns. While Enraged, he only uses his normal attack and gains a 100% damage bonus multiplier",
                    "cooldown": 1
                }
            ],
            "lore": "Krakoa is a Voidblade operative in the Constellian Navy’s elite special forces division, originally born and trained in Silgar. Though a graduate of StarSprawler Academy, Krakoa’s path through the academy was anything but conventional. His combat instincts, while exceptional, were often flagged as dangerously aggressive — nearly disqualifying him from advancement. He was eventually recruited into the Voidblade program after catching the attention of a Vice Helm during a live simulation."
        },
        {
            "name": "Mizca",
            "hp": 800,
            "speed": 30,
            "rarity": "R",
            "SigChargeReq": 100,
            "imageName": "Mizca",
            "moves": [
                {
                    "name": "Multiplying Rage",
                    "description": "At the end of each round,The Mizca gains 15% damage bonus (capped at 50%) but takes 10 true damage.",
                    "cooldown": 0
                },
                {
                    "name": "Saber Slice",
                    "description": "The Mizca slices with his rift weapon, dealing 40 energy damage.",
                    "cooldown": 1
                },
                {
                    "name": "Hold Choke",
                    "description": "Mizca chokes an opponent, dealing 35 Air damage. If the opponent has less than half their max HP, they will gain Weakened, and do 30% reduced damage on their next attack.",
                    "cooldown": 2
                },
                {
                    "name": "Power of the Corrupted",
                    "description": "Mizca rips at the very foundations of the battleground, and hurls large rocks at his enemies. Deals 55 earth damage at two enemies",
                    "cooldown": 1
                }
            ],
            "lore":"Mizca are high-tier riftborn entities most commonly associated with Class B riftbreaks, though many A-class incidents have reported them as forward units. Standing taller than a giraffe at full extension but built with a broad, humanoid physique, Mizca embody both raw power and battlefield disruption. Despite their brutish profile, Mizca display alarming spatial awareness and can track fast-moving targets with unsettling accuracy."
        },
        {
            "name": "Nou",
            "hp": 600,
            "speed": 50,
            "rarity": "L",
            "SigChargeReq": 200,
            "imageName": "Nou",
            "moves": [
                {
                    "name": "Sky Goddess",
                    "description": "Nou is immune to air damage, and has a 40% chance to dodge attacks from characters",
                    "cooldown": 0
                },
                {
                    "name": "Whirlwind",
                    "description": "Nou shoots a cyclone dealing 30 Air damage at two enemies",
                    "cooldown": 1
                },
                {
                    "name": "Dust Storm",
                    "description": "Nou creates a dust storm. Deals 20 air damage and inflicts Covered, which reduces target's accuracy by 50% this turn",
                    "cooldown": 2
                },
                {
                    "name": "World Wind",
                    "description": "Nou creates a powerful windstorm that deals 60 air damage to all enemies",
                    "cooldown": 1
                }
            ],
            "lore":"Nou is a wind-aligned divine goddess and the central protector of Aetherion, one of the three major systems of Arkhalion’s Delta. Though once a lesser worshipped entity in the pre-Breakpoint era, Nou rose to prominence after the catastrophe, becoming the spiritual and magical guardian of survivors in the southern hemisphere. In the present day, she is the last god still active on Arkhalion and is considered the founder and enduring protector of Aetherion."
        },
        {
            "name": "Olthar",
            "hp": 880,
            "speed": 37,
            "rarity": "UR",
            "SigChargeReq": 120,
            "imageName": "Olthar",
            "moves": [
                {
                    "name": "Arbiter of Silgar",
                    "description": "Party members under 100 HP gain a 50% damage buff (checked at start of each round)",
                    "cooldown": 0
                },
                {
                    "name": "Ocular Blaster",
                    "description": "Olthar shoots an enery blast from his eyes, dealing 35 energy damage.",
                    "cooldown": 1
                },
                {
                    "name": "Concussive Wave",
                    "description": "Olthar's Hands shoot a wave of concussive force, dealing 20 air damage per enemy.",
                    "cooldown": 3
                },
                {
                    "name": " Word of Judgement",
                    "description": "Olthar deals 60 energy damage and 15 energy damage to an enemy for the next two turns.",
                    "cooldown": 1
                }
            ],
            "lore": "Olthar is the Lawbearer of Silgar and the highest judicial authority in the city-state. A sentient construct forged by the Intergalactic Wizarding Organization (IWO) during the darkest days of Silgar’s history, Olthar represents the fusion of divine essence, technomantic engineering, and legal idealism. Though not a divine being in strength, he possesses a soul, one of the first successful artificial souls ever manifested, and a mind built for clarity, logic, and incorruptibility.\nHe is widely credited with ending Silgar’s most shameful period (The Shrouded Silgar era) and establishing the modern legal and ethical framework under which the city now operates. "
        },
        {
            "name": "Rover",
            "hp": 400,
            "speed": 7,
            "rarity": "C",
            "SigChargeReq": 30,
            "imageName": "Rover",
            "moves": [
                {
                    "name": "Targeting System",
                    "description": "Increases allies accuracy by 20%",
                    "cooldown": 0
                },
                {
                    "name": "Zapper",
                    "description": "Deals 10 lightning damage",
                    "cooldown": 1
                },
                {
                    "name": "Confusion Tactics",
                    "description": "Rover's anti-radar lowers an enemy's accuracy by 15%, deals 15 physical damage",
                    "cooldown": 2
                },
                {
                    "name": "System Hack",
                    "description": "Rover finds the opponents weak spots. All enemies lightning and energy resistance is reduced by 30%",
                    "cooldown": 1
                }
            ],
            "lore":"Rover is a modified combat-support droid serving aboard Constellian Navy single-pilot interceptor vessels as a tactical adjunct and systems specialist. Originally built from a common astromech-class model available to civilians in Constellian systems, Rover has undergone extensive post-manufacture modification to meet the Navy’s high-performance standards — particularly those of the elite Riftstrike carrier fleet. \n Unlike most non-sentient droids, Rover possesses a stable AI core with adaptive learning protocols, giving him a distinct personality and battlefield intuition. While he is not unique in chassis design, the combination of his field modifications and accumulated experience make him one of the most reliable droids in the Navy’s current roster."
        },
        {
            "name": "Raish",
            "hp": 600,
            "speed": 20,
            "rarity": "UC",
            "SigChargeReq": 75,
            "imageName": "Raish",
            "moves": [
                {
                    "name": "Sacrifice",
                    "description": "When an ally dies, Raish's damage is increased by 50%",
                    "cooldown": 0
                },
                {
                    "name": "Claw",
                    "description": "Raish strikes dealing 20 poison damage",
                    "cooldown": 1
                },
                {
                    "name": "Venomous Strike",
                    "description": "Raish bites with its corrupted mouth, dealing 30 poison damage",
                    "cooldown": 2
                },
                {
                    "name": "Martyr",
                    "description": "Raish deals poison damage equal to 150% of the damage it has received",
                    "cooldown": 1
                }
            ],
            "lore": "Raish are corrupted quadrupedal riftbeasts commonly encountered in Class C or D riftbreaks across Arkhalion and nearby systems. They are mutated derivatives of a natural predator species known as the Rais, once native to Arkhalion’s southern forests and highlands. While Rais were roughly the size and strength of a large mastiff, rift corruption amplifies their aggression, durability, and instinctive cunning, making the Raish a dangerous threat in groups."
        },
        {
            "name": "Rei",
            "hp": 800,
            "speed": 32,
            "rarity": "UR",
            "SigChargeReq": 100,
            "imageName": "Rei",
            "moves": [
                {
                    "name": "Electric Empress",
                    "description": "The shogun is immune to lightning damage. She is also immune to Energy attacks dealing 30 damage or less",
                    "cooldown": 0
                },
                {
                    "name": "Katana Strike",
                    "description": "The Shogun attacks with her lightning katana, dealing 40 lightning damage",
                    "cooldown": 1
                },
                {
                    "name": "Burst Charge",
                    "description": "Rei deals 35 Lightning damage to an opponent and inflicts Electroshock for 2 turns. Enemies that are electroshocked have their electric and water resistance decreased by 20%, and will take 10 damage per turn",
                    "cooldown": 3
                },
                {
                    "name": "Musou no Hitotachi",
                    "description": "The Shogun slices the fabric of reality with her blade, dealing 140 lightning damage at an enemy and a 40% chance to inflict Stun. Stunned enemies cannot act on their turn, but status effects will take place",
                    "cooldown": 1
                }
            ],
            "lore": "Rei is a mid-ranking operative within the Applied Arcana Division of the Intergalactic Wizarding Organization (IWO), holding the formal clearance rank of Tier IV Arc Warden. She is based on Arkhalion, where she oversees the testing and deployment of experimental magical technologies near active or unstable rift zones. Though not originally trained as a combatant, Rei’s years in the field have sharpened her reflexes and resilience to the point where even elite Silgarian soldiers acknowledge her capability in high-risk zones."      
        },
        {
            "name": "Sedra",
            "hp": 700,
            "speed": 60,
            "rarity": "R",
            "SigChargeReq": 100,
            "imageName": "Sedra",
            "moves": [
                {
                    "name": "Tamaranean Durability",
                    "description": "Sedra has a 50% chance to ignore physical attacks under 30 damage.",
                    "cooldown": 0
                },
                {
                    "name": "Heat Vision",
                    "description": "Sedra shoots lasers out her eyes and deals 40 Energy Damage.",
                    "cooldown": 1
                },
                {
                    "name": "Nova Lash",
                    "description": "Sedra dashes in and slashes a target with solar fire, dealing 40 energy damage and applying Solar Wind (20 energy dmg over 2 turns)",
                    "cooldown": 2
                },
                {
                    "name": "Starburst Explosion",
                    "description": "Sedra launches a giant explosion, dealing 50 AoE energy damage.",
                    "cooldown": 1
                }
            ],
            "lore": "Sedra is a magically gifted young woman born in Aetherion, the daughter of two of the city’s most influential figures. Her father holds the Elevation Seat on the Council of Ascendance, while her mother serves as the current Windsage of the Whispering Academy. From an early age, Sedra demonstrated signs of inborn divine energy, believed by scholars to be a faint resonance of Nou’s blessing, or perhaps a unique convergence of Aetherion’s ley currents and her bloodline. She is a rising defender of Aetherion and often serves as a first response combatant for major rift activity in the region."
        },
        {
            "name": "TRex",
            "hp": 960,
            "speed": 24,
            "rarity": "R",
            "SigChargeReq": 130,
            "imageName": "Trex",
            "moves": [
                {
                    "name": "Apex Predator",
                    "description": "When T-Rex is the only surviving member of his team, gain 50% damage and full signature charge",
                    "cooldown": 0
                },
                {
                    "name": "CHOMP",
                    "description": "Trex bites dealing 40 physical damage",
                    "cooldown": 1
                },
                {
                    "name": "ROAR",
                    "description": "The Rex attempts to inflict terrify on a target.Terrified lasts 2 turns and decreases accuracy by 40% and damage by 50%. Base 20% chance. For every 10% below the maxHP of the target, chance to terrify the target increases 20%.",
                    "cooldown": 3
                },
                {
                    "name": "Tyrant Lizard King",
                    "description": "Trex bites dealing 50 physical damage and inflict Poisoned. When Poisoned, The target takes 20 poison damage for the next 2 turns",
                    "cooldown": 1
                }
            ],
            "lore": "A towering, rift-altered predator, the Corrupted T-Rex is an apex-class threat born from the dimensional corruption of a prehistoric Earth-like species. This riftbeast falls under the category of a rift-mutated natural organism, elevated far beyond its original capabilities by exposure to high-intensity riftfields. \n Reports place its height at nearly 20 meters with enhanced bone density, triple-reinforced musculature, and rift-reactive scales that shed kinetic energy over time. Despite its brutish form, it is one of the most persistent planetary-scale threats recorded outside of Apex-Class 2 entities."
        },
        {
            "name": "Ulmika",
            "hp": 520,
            "speed": 10,
            "rarity": "UC",
            "SigChargeReq": 140,
            "imageName": "Ulmika",
            "moves": [
                {
                    "name": "Aretuza's Patronage",
                    "description": "Ulmika removes a debuff on an ally once per round on her turn",
                    "cooldown": 0
                },
                {
                    "name": "Witch's Chill",
                    "description": "Ulmika deals 15 ice dmg",
                    "cooldown": 1
                },
                {
                    "name": "Witch's Blessing",
                    "description": "Yen grants a shield of 50 points to 2 allies or herself",
                    "cooldown": 2
                },
                {
                    "name": "Flaming Devastation",
                    "description": "Yen consumes 60% of her current HP and deals 70 fire damage and inflict Burn for an additional 20 fire damage for 2 turns",
                    "cooldown": 1
                }
            ],
            "lore": "Ulmika is a Tier II Field Agent assigned to the Reconnaissance Subfield of the IWO Combat Division. Born in Arkhalion’s lower plains region and raised in a modest settlement rebuilt after the Breakpoint, Ulmika was recruited early into the IWO following a childhood encounter with a minor riftbreak — an event that left her with a distinctive rift-colored eye and a subtle, persistent sensitivity to rift phenomena.\n She now operates as part of forward-deployed detachments, often assigned to accompany Constellian military units during Class 3–4 riftbreaks. Her role blends recon, magical analysis, and long-range elemental support."
        },
        {
            "name": "VyGar",
            "hp": 800,
            "speed": 33,
            "rarity": "R",
            "SigChargeReq": 80,
            "imageName": "VyGar",
            "moves": [
                {
                    "name": "Defensive Rock",
                    "description": "All resistances for all allies increase by 10%",
                    "cooldown": 0
                },
                {
                    "name": "Spear Strike",
                    "description": "VyGar attacks dealing 30 physical damage",
                    "cooldown": 1
                },
                {
                    "name": "Meteor Strike",
                    "description": "VyGar fires a rock at all opponents. Each hit does 15 earth damage.",
                    "cooldown": 2
                },
                {
                    "name": "Mighty Shield",
                    "description": "VyGar casts a shield on a party member. This shield has 350 shield points.",
                    "cooldown": 1
                }
            ],
            "lore": "VyGar is a Zavrosian weapons appraiser contracted frequently by the Constellian Armed Forces and various independent trusts. He specializes in collecting weapons that have historical, political, or tactical significance. Born in the forge-cluster of Durnskarn, he rejected his clan’s traditional role as smiths and became an interpreter of weapon history instead. His knowledge of both conventional and technomantic arms has made him a valued figure in intelligence and logistics circles. Though officially unaffiliated with any state, VyGar operates on the edge of legality, with suspected ties to unsanctioned trade networks across the Alliance."
        }
    ]
}